In [14]:
pip install pandas

Requirement already satisfied: pandas in c:\users\eatsk\appdata\local\programs\python\python311\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.23.2 in c:\users\eatsk\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\eatsk\appdata\roaming\python\python311\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\eatsk\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\eatsk\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\eatsk\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
l=[1,2,3,4,5,6,7,8,9,10]
print(l[1:10:2])

[2, 4, 6, 8, 10]

In [15]:
import pandas as pd

In [16]:
datas=[1,2,5,4,5]
new_index=[1,2,3,4,5]
s=pd.Series(datas,index=new_index,dtype=int)
print(s)

1    1
2    2
3    5
4    4
5    5
dtype: int64

In [17]:
t=pd.DataFrame(datas,index=new_index,columns=['numbers'])
t

   numbers
1        1
2        2
3        5
4        4
5        5

In [18]:
datas2={'name':['ali','ahmad','sara','lina','mona'],
        'age':[23,25,21,22,24],
        'city':['cairo','giza','alex','cairo','giza']}

In [19]:
x=pd.DataFrame(datas2)
x

    name  age   city
0    ali   23  cairo
1  ahmad   25   giza
2   sara   21   alex
3   lina   22  cairo
4   mona   24   giza

In [20]:
s=x.loc[0::,'name']
s

0      ali
1    ahmad
2     sara
3     lina
4     mona
Name: name, dtype: object

In [22]:
x[x['name']=='ali']

  name  age   city
0  ali   23  cairo